RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_trng.h
/***************************************************************************//**
* \file cy_cryptolite_trng.h
* \version 2.80
*
* \brief
*  This file provides common constants and parameters
*  for the Cryptolite TRNG driver.
*
********************************************************************************
* Copyright 2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#if !defined (CY_CRYPTOLITE_TRNG_H)
#define CY_CRYPTOLITE_TRNG_H

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_cryptolite_common.h"

#if (CRYPTOLITE_TRNG_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_TRNG_C)

/** \cond INTERNAL */
#define CY_CRYPTOLITE_TRNG_RO_ENABLE           (1U)
#define CY_CRYPTOLITE_TRNG_RO_DISABLE          (0U)
/** \endcond */

/** \cond INTERNAL */
typedef enum
{
    /** "Selection of the ring oscillator (RO) source: */
    CY_CRYPTOLITE_TRNG_SRC_RO11 = 0,  /**< "0": fixed RO 11 bit. */
    CY_CRYPTOLITE_TRNG_SRC_RO15,      /**< "1": fixed RO 15 bit. */
    CY_CRYPTOLITE_TRNG_SRC_GARO15,    /**< "2": fixed Galois RO 15 bit. */
    CY_CRYPTOLITE_TRNG_SRC_GARO31,    /**< "3": flexible Galois RO 31 bit. */
    CY_CRYPTOLITE_TRNG_SRC_FIRO15,    /**< "4": fixed Fibonacci RO 15 bit. */
    CY_CRYPTOLITE_TRNG_SRC_FIRO31     /**< "5": flexible Fibonacci RO 31 bit. */
} cy_en_cryptolite_trng_ro_sel_t;
/** \endcond */

/******************************************
 * Configuration structure
 ******************************************/
/** \cond INTERNAL */
typedef enum
{
    /** "Selection of the bitstream: */
    CY_CRYPTOLITE_TRMON_BS_DAS = 0, /**< "0": DAS bitstream. */
    CY_CRYPTOLITE_TRMON_BS_RED,     /**< "1": RED bitstream. */
    CY_CRYPTOLITE_TRMON_BS_TR,      /**< "2": TR bitstream.  */
    CY_CRYPTOLITE_TRMON_BS_UNDEF    /**< "3": Undefined.     */
} cy_en_cryptolite_trng_bs_sel_t;
/** \endcond */

/** The structure for storing the TRNG configuration.
*/
typedef struct
{
    /** \cond INTERNAL */
/**
     * "Specifies the clock divider that is used to sample oscillator data.
     * This clock divider is wrt. "clk_sys".
     * "0": sample clock is "clk_sys".
     * "1": sample clock is "clk_sys"/2.
     *
     * "255": sample clock is "clk_sys"/256. */
    uint8_t sampleClockDiv;
    /**
     * "Specifies the clock divider that is used to produce reduced bits.
     * "0": 1 reduced bit is produced for each sample.
     * "1": 1 reduced bit is produced for each 2 samples.
     *
     * "255": 1 reduced bit is produced for each 256 samples. */
    uint8_t reducedClockDiv;
    /**
     * Specifies an initialization delay: number of removed/dropped samples
     * before reduced bits are generated. This field should be programmed
     * in the range [1, 255]. After starting the oscillators,
     * at least the first 2 samples should be removed/dropped to clear the state
     * of internal synchronizers. In addition, it is advised to drop
     * at least the second 2 samples from the oscillators (to circumvent
     * the semi-predictable oscillator startup behavior).
     *
     * This result in the default field value of "3".
     * Field encoding is as follows:
     * "0": 1 sample is dropped.
     * "1": 2 samples are dropped.
     *
     * "255": 256 samples are dropped.
     *
     * The TR_INITIALIZED interrupt cause is set to '1', when
     * the initialization delay is passed. */
    uint8_t initDelay;
    /**
     * "Specifies if the "von Neumann corrector" is disabled or enabled:
     * '0': disabled.
     * '1': enabled.
     * The "von Neumann corrector" post-processes the reduced bits
     * to remove a '0' or '1' bias. The corrector operates on reduced bit pairs
     * ("oldest bit, newest bit"):
     * "00": no bit is produced.
     * "01": '0' bit is produced (oldest bit).
     * "10": '1' bit is produced (oldest bit).
     * "11": no bit is produced.
     * Note that the corrector produces bits at a random pace and at a frequency
     * that is 1/4 of the reduced bit frequency (reduced bits are processed
     * in pairs, and half of the pairs do NOT produce a bit). */
    bool    vnCorrectorEnable;
    /**
     * Specifies if TRNG adaptive proportion(AP) Test is enabled
     * When test fails INTR.TR_AP_DETECT is set to '1'. */
    bool    EnableAPTest;
    /**
     * Specifies if TRNG repetition count(RC) Test is enabled
     * When test fails INTR.TR_RC_DETECT is set to '1'. */
    bool    EnableRCTest;
    /**
     * Specifies if TRNG functionality is stopped on an adaptive proportion
     * test detection (when HW sets INTR.TR_AP_DETECT to '1'):
     * '0': Functionality is NOT stopped.
     * '1': Functionality is stopped (TR_CTL1 fields are set to '0' by HW).
     * valid only if EnableAPTest is set to true */
    bool    stopOnAPDetect;
    /**
     * Specifies if TRNG functionality is stopped on a repetition
     * count test detection (when HW sets INTR.TR_RC_DETECT to '1'):
     * '0': Functionality is NOT stopped.
     * '1': Functionality is stopped (TR_CTL1 fields are set to '0' by HW).
     * valid only if EnableRCTest is set to true */
    bool    stopOnRCDetect;
    /**
     * Polynomial for programmable Galois ring oscillator.
     * The polynomial is represented WITHOUT
     * the high order bit (this bit is always assumed '1').
     * The polynomial should be aligned such that the more
     * significant bits (bit 30 and down) contain the polynomial
     * and the less significant bits (bit 0 and up) contain padding '0's. */
    uint32_t garo31Poly;
    /**
     * Polynomial for programmable Fibonacci ring oscillator.
     * The polynomial is represented WITHOUT
     * the high order bit (this bit is always assumed '1').
     * The polynomial should be aligned such that the more
     * significant bits (bit 30 and down) contain the polynomial
     * and the less significant bits (bit 0 and up) contain padding '0's. */
    uint32_t firo31Poly;
    /**
     * Selection of the bitstream:
     * "0": DAS bitstream.
     * "1": RED bitstream.
     * "2": TR bitstream.
     * "3": Undefined.  */
    cy_en_cryptolite_trng_bs_sel_t monBitStreamSelect;
    /**
     * Cutoff count (legal range is [1, 255]):
     * "0": Illegal.
     * "1": 1 repetition.
     * ..
     * "255": 255 repetitions. */
    uint8_t monCutoffCount8;
    /**
     * Cutoff count (legal range is [1, 65535]).
     * "0": Illegal.
     * "1": 1 occurrence.
     * ...
     * "65535": 65535 occurrences. */
    uint16_t monCutoffCount16;
    /**
     * Window size (minus 1) :
     * "0": 1 bit.
     * ...
     * "65535": 65536 bits. */
    uint16_t monWindowSize;
    /** \endcond */
} cy_stc_cryptolite_trng_config_t;

/**
* \addtogroup group_cryptolite_lld_rng_functions
* \{
*/

