RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_trng.h
/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng
****************************************************************************//**
*
* Generates a True Random Number.
*
* \param base
* The pointer to the cryptolite instance.
*
* \param randomNum
* The pointer to a generated true random number.
*
* \return
* \ref cy_en_cryptolite_status_t
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng(CRYPTOLITE_Type *base, uint32_t *randomNum);

/** \} group_cryptolite_lld_rng_functions */



/** \cond INTERNAL */

/* Macros for conditions used by CY_ASSERT calls */
#define CY_CRYPTOLITE_IS_SMPL_CLK_DIV_VALID(clkDiv)     ((clkDiv) <= 255U)
#define CY_CRYPTOLITE_IS_RED_CLK_DIV_VALID(clkDiv)      ((clkDiv) <= 255U)
#define CY_CRYPTOLITE_IS_INIT_DELAY_VALID(delay)        ((delay) <= 255U)
#define CY_CRYPTOLITE_IS_VONN_CORR_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_AP_DETECT_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_RC_DETECT_VALID(val)           ((uint32_t)(val) <= 1U)

#define CY_CRYPTOLITE_IS_RO11_EN_VALID(val)             ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_RO15_EN_VALID(val)             ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_GARO15_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_GARO31_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_FIRO15_EN_VALID(val)           ((uint32_t)(val) <= 1U)
#define CY_CRYPTOLITE_IS_FIRO31_EN_VALID(val)           ((uint32_t)(val) <= 1U)

#define CY_CRYPTOLITE_IS_GARO_POLY_VALID(val)           ((val) <= 0x7FFFFFFFUL)
#define CY_CRYPTOLITE_IS_FIRO_POLY_VALID(val)           ((val) <= 0x7FFFFFFFUL)

#define CY_CRYPTOLITE_IS_BS_SELECT_VALID(val)           (((val) == CY_CRYPTOLITE_TRMON_BS_DAS) || \
                                                        ((val) == CY_CRYPTOLITE_TRMON_BS_RED) || \
                                                        ((val) == CY_CRYPTOLITE_TRMON_BS_TR))

#define CY_CRYPTOLITE_IS_CCOUNT8_VALID(val)             ((val) <= 255U)
#define CY_CRYPTOLITE_IS_CCOUNT16_VALID(val)            ((val) <= 65535U)
#define CY_CRYPTOLITE_IS_WINSIZE_VALID(val)             ((val) <= 65535U)

#define CY_CRYPTOLITE_TRNG_AP_DETECT_ERROR_BIT          (0U)
#define CY_CRYPTOLITE_TRNG_RC_DETECT_ERROR_BIT          (1U)
#define CY_CRYPTOLITE_TRNG_AP_DETECT_ERROR              (1U << 0U)
#define CY_CRYPTOLITE_TRNG_RC_DETECT_ERROR              (1U << 1U)

#define CY_CRYPTOLITE_TRNG_RO_ALL_MASK                  (uint32_t)(CRYPTOLITE_TRNG_CTL1_RO11_EN_Msk | \
                                                        CRYPTOLITE_TRNG_CTL1_RO15_EN_Msk | \
                                                        CRYPTOLITE_TRNG_CTL1_GARO15_EN_Msk | CRYPTOLITE_TRNG_CTL1_GARO31_EN_Msk | \
                                                        CRYPTOLITE_TRNG_CTL1_FIRO15_EN_Msk | CRYPTOLITE_TRNG_CTL1_FIRO31_EN_Msk)
/** FW sets this field to '1' to enable the ring oscillator with 11 inverters. */
#define CY_CRYPTOLITE_DEF_TRNG_RO11_EN                  (1UL)

/** FW sets this field to '1' to enable the ring oscillator with 15 inverters. */
#define CY_CRYPTOLITE_DEF_TRNG_RO15_EN                  (1UL)

/**
* FW sets this field to '1' to enable the fixed Galois ring oscillator
* with 15 inverters.
*/
#define CY_CRYPTOLITE_DEF_TRNG_GARO15_EN                (1UL)

/**
* FW sets this field to '1' to enable the programmable Galois ring oscillator with up
* to 31 inverters. The TR_GARO_CTL register specifies the programmable polynomial.
*/
#define CY_CRYPTOLITE_DEF_TRNG_GARO31_EN                (1UL)

/** FW sets this field to '1' to enable the fixed Fibonacci ring oscillator with 15 inverters. */
#define CY_CRYPTOLITE_DEF_TRNG_FIRO15_EN                (1UL)

/**
* FW sets this field to '1' to enable the programmable Fibonacci ring oscillator
* with up to 31 inverters. The TR_FIRO_CTL register specifies the programmable polynomial.
*/
#define CY_CRYPTOLITE_DEF_TRNG_FIRO31_EN                (1UL)

extern const cy_stc_cryptolite_trng_config_t            cy_cryptolite_trngDefaultConfig;

__STATIC_INLINE bool Cy_Cryptolite_Trng_IsInitialized(CRYPTOLITE_Type *base);
__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_GetRoStatus(CRYPTOLITE_Type *base, cy_en_cryptolite_trng_ro_sel_t roSelector);
__STATIC_INLINE void Cy_Cryptolite_Trng_SetRoStatus(CRYPTOLITE_Type *base,
                                                     cy_en_cryptolite_trng_ro_sel_t roSelector, uint8_t roStatus);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetData(CRYPTOLITE_Type *base);
__STATIC_INLINE void Cy_Cryptolite_Trng_SetGaroPoly(CRYPTOLITE_Type *base, uint32_t poly);
__STATIC_INLINE void Cy_Cryptolite_Trng_SetFiroPoly(CRYPTOLITE_Type *base, uint32_t poly);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetGaroPoly(CRYPTOLITE_Type *base);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetFiroPoly(CRYPTOLITE_Type *base);

__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_MonGetHealthStatus(CRYPTOLITE_Type *base);

__STATIC_INLINE uint8_t  Cy_Cryptolite_Trng_MonGetRcRepCount(CRYPTOLITE_Type *base);
__STATIC_INLINE uint16_t Cy_Cryptolite_Trng_MonGetApOccCount(CRYPTOLITE_Type *base);
__STATIC_INLINE uint16_t Cy_Cryptolite_Trng_MonGetApWindowIndex(CRYPTOLITE_Type *base);

__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_MonGetRcCurrentBit(CRYPTOLITE_Type *base);
__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_MonGetApCurrentBit(CRYPTOLITE_Type *base);

__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Trng_MonSetBSSelector(CRYPTOLITE_Type *base, cy_en_cryptolite_trng_bs_sel_t bitStreamSelector);
__STATIC_INLINE cy_en_cryptolite_trng_bs_sel_t Cy_Cryptolite_Trng_MonGetBSSelector(CRYPTOLITE_Type *base);

__STATIC_INLINE void Cy_Cryptolite_Trng_MonEnableApTest(CRYPTOLITE_Type *base);
__STATIC_INLINE void Cy_Cryptolite_Trng_MonDisableApTest(CRYPTOLITE_Type *base);
__STATIC_INLINE void Cy_Cryptolite_Trng_MonEnableRcTest(CRYPTOLITE_Type *base);
__STATIC_INLINE void Cy_Cryptolite_Trng_MonDisableRcTest(CRYPTOLITE_Type *base);

