RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_trng.h
__STATIC_INLINE void Cy_Cryptolite_Trng_MonSetRcCC8(CRYPTOLITE_Type *base, uint8_t ccCount);
__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_MonGetRcCC8(CRYPTOLITE_Type *base);

__STATIC_INLINE void Cy_Cryptolite_Trng_MonSetApCC16(CRYPTOLITE_Type *base, uint16_t ccCount);
__STATIC_INLINE uint16_t Cy_Cryptolite_Trng_MonGetApCC16(CRYPTOLITE_Type *base);

__STATIC_INLINE void Cy_Cryptolite_Trng_MonSetApWinSize(CRYPTOLITE_Type *base, uint16_t windowSize);
__STATIC_INLINE uint16_t Cy_Cryptolite_Trng_MonGetApWinSize(CRYPTOLITE_Type *base);

__STATIC_INLINE void Cy_Cryptolite_Trng_WaitForComplete(CRYPTOLITE_Type *base);
__STATIC_INLINE void Cy_Cryptolite_Trng_WaitForInit(CRYPTOLITE_Type *base);

/** \endcond */


/**
* \addtogroup group_cryptolite_lld_rng_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_Init
****************************************************************************//**
*
* Initialize the TRNG hardware submodule
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param config
* The pointer to the configuration structure. If NULL default config is used.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng_Init(CRYPTOLITE_Type *base, cy_stc_cryptolite_trng_config_t *config);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_Enable
****************************************************************************//**
*
* Starts a random number generation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The error / status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng_enable_disable
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng_Enable(CRYPTOLITE_Type *base);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_Disable
****************************************************************************//**
*
* Stops the random number generation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The error / status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng_enable_disable
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng_Disable(CRYPTOLITE_Type *base);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_ReadData
****************************************************************************//**
*
* Reads in blocking mode a generated random number.
*
* \note
* Call this API only after Cy_Cryptolite_Trng_Enable() is successful.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param randomData
* The pointer to a generated true random number.
*
* \return
* The error / status code. See \ref cy_en_cryptolite_status_t.
*
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng_ReadData(CRYPTOLITE_Type *base, uint32_t *randomData);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_DeInit
****************************************************************************//**
*
* Clears all TRNG registers by set to hardware default values.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The error / status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Trng_DeInit(CRYPTOLITE_Type *base);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_IsEnabled
****************************************************************************//**
*
* Checks if Trng is enabled.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The 'true' if Trng enabled 'false' otherwise.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Trng_enable_disable
*******************************************************************************/
bool Cy_Cryptolite_Trng_IsEnabled(CRYPTOLITE_Type *base);

/** \} group_cryptolite_lld_rng_functions */

__STATIC_INLINE void Cy_Cryptolite_Trng_SetInterruptMask(CRYPTOLITE_Type *base, uint32_t interrupts);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptMask(CRYPTOLITE_Type const *base);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptStatusMasked(CRYPTOLITE_Type const *base);
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptStatus(CRYPTOLITE_Type *base);
/*
 * API Implementations
 */


/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_SetInterruptMask
***************************************************************************//**
*
* Masks / unmasks multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Mask bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_SetInterruptMask(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_TRNG_MASK(base) = interrupts;
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_GetInterruptMask
***************************************************************************//**
*
* Reports mask / unmask multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Mask bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptMask(CRYPTOLITE_Type const *base)
{
    return (REG_CRYPTOLITE_INTR_TRNG_MASK(base));
}

