RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_trng.h
/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_GetInterruptStatusMasked
***************************************************************************//**
*
* Reports states of multiple enabled interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Source bits. See definitions above.
*
*****************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptStatusMasked(CRYPTOLITE_Type const *base)
{
    return (REG_CRYPTOLITE_INTR_TRNG_MASKED(base));
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_GetInterruptStatus
***************************************************************************//**
*
* Reports states of multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Source bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Trng_GetInterruptStatus(CRYPTOLITE_Type *base)
{
    return (REG_CRYPTOLITE_INTR_TRNG(base));
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_SetInterrupt
***************************************************************************//**
*
* Sets one of more interrupt sources
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Source bit(s)
*
******************************************************************************/
__STATIC_INLINE void  Cy_Cryptolite_Trng_SetInterrupt(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_TRNG_SET(base) = interrupts;
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Trng_ClearInterrupt
***************************************************************************//**
*
* Clears multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Source bit(s). See definitions above.
*
******************************************************************************/
__STATIC_INLINE void  Cy_Cryptolite_Trng_ClearInterrupt(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_TRNG(base) = interrupts;
    /* This dummy reading is necessary here. It provides a guarantee that interrupt is cleared at returning from this function. */
    (void) REG_CRYPTOLITE_INTR_TRNG(base);
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_SetInterruptMask
***************************************************************************//**
*
* Masks / unmasks multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Mask bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Error_SetInterruptMask(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_ERROR_MASK(base) = interrupts;
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_GetInterruptMask
***************************************************************************//**
*
* Reports mask / unmask multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Mask bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Error_GetInterruptMask(CRYPTOLITE_Type const *base)
{
    return (REG_CRYPTOLITE_INTR_ERROR_MASK(base));
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_GetInterruptStatusMasked
***************************************************************************//**
*
* Reports states of multiple enabled interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Source bits. See definitions above.
*
*****************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Error_GetInterruptStatusMasked(CRYPTOLITE_Type const *base)
{
    return (REG_CRYPTOLITE_INTR_ERROR_MASKED(base));
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_GetInterruptStatus
***************************************************************************//**
*
* Reports states of multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* Source bits. See definitions above.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_Cryptolite_Error_GetInterruptStatus(CRYPTOLITE_Type *base)
{
    return (REG_CRYPTOLITE_INTR_ERROR(base));
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_SetInterrupt
***************************************************************************//**
*
* Sets one of more interrupt sources
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Source bit(s)
*
******************************************************************************/
__STATIC_INLINE void  Cy_Cryptolite_Error_SetInterrupt(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_ERROR_SET(base) = interrupts;
}

/******************************************************************************
* Function Name: Cy_Cryptolite_Error_ClearInterrupt
***************************************************************************//**
*
* Clears multiple interrupt sources.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param interrupts
* Source bit(s). See definitions above.
*
******************************************************************************/
__STATIC_INLINE void  Cy_Cryptolite_Error_ClearInterrupt(CRYPTOLITE_Type *base, uint32_t interrupts)
{
    REG_CRYPTOLITE_INTR_ERROR(base) = interrupts;
    /* This dummy reading is necessary here. It provides a guarantee that interrupt is cleared at returning from this function. */
    (void) REG_CRYPTOLITE_INTR_ERROR(base);
}


