RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_trng.h
/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonSetBSSelector
****************************************************************************//**
*
* Sets the BitStream selector value of the TRNG monitor.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param bitStreamSelector
* The BitStream selector value (see \ref cy_en_cryptolite_trng_bs_sel_t).
*
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Trng_MonSetBSSelector(CRYPTOLITE_Type *base,
                                                                           cy_en_cryptolite_trng_bs_sel_t bitStreamSelector)
{
    cy_en_cryptolite_status_t status = CY_CRYPTOLITE_SUCCESS;

    CY_ASSERT_L3(CY_CRYPTOLITE_IS_BS_SELECT_VALID(bitStreamSelector));

    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_CTL(base), CRYPTOLITE_TRNG_MON_CTL_BITSTREAM_SEL, bitStreamSelector);

    return status;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonGetBSSelector
****************************************************************************//**
*
* Reads the BitStream selector value of the TRNG monitor.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The BitStream selector value (see \ref cy_en_cryptolite_trng_bs_sel_t).
*
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_trng_bs_sel_t Cy_Cryptolite_Trng_MonGetBSSelector(CRYPTOLITE_Type *base)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_cryptolite_trng_bs_sel_t enum.');
    return ((cy_en_cryptolite_trng_bs_sel_t)_FLD2VAL(CRYPTOLITE_TRNG_MON_CTL_BITSTREAM_SEL, REG_CRYPTOLITE_TRNG_MON_CTL(base)));
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonEnableApTest
****************************************************************************//**
*
* Enables the Adaptive proportion (AP) test.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonEnableApTest(CRYPTOLITE_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_CTL(base), CRYPTOLITE_TRNG_MON_CTL_AP, 1U);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonDisableApTest
****************************************************************************//**
*
* Disables the Adaptive proportion (AP) test.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonDisableApTest(CRYPTOLITE_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_CTL(base), CRYPTOLITE_TRNG_MON_CTL_AP, 0U);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonEnableRcTest
****************************************************************************//**
*
* Enables the Repetition count (RC) test.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonEnableRcTest(CRYPTOLITE_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_CTL(base), CRYPTOLITE_TRNG_MON_CTL_RC, 1U);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonDisableRcTest
****************************************************************************//**
*
* Disables the Repetition count (RC) test.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonDisableRcTest(CRYPTOLITE_Type *base)
{
    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_CTL(base), CRYPTOLITE_TRNG_MON_CTL_RC, 0U);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonSetRcCC8
****************************************************************************//**
*
* Sets the Cutoff counter value of the repetition counter test monitor.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param ccCount
* The new Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonSetRcCC8(CRYPTOLITE_Type *base, uint8_t ccCount)
{
    REG_CRYPTOLITE_TRNG_MON_RC_CTL(base) = (uint32_t)_VAL2FLD(CRYPTOLITE_TRNG_MON_RC_CTL_CUTOFF_COUNT8, ccCount);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonGetRcCC8
****************************************************************************//**
*
* Reads the Cutoff counter value of the repetition counter test monitor.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \return
* The Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_Cryptolite_Trng_MonGetRcCC8(CRYPTOLITE_Type *base)
{
    return ((uint8_t)_FLD2VAL(CRYPTOLITE_TRNG_MON_RC_CTL_CUTOFF_COUNT8, REG_CRYPTOLITE_TRNG_MON_RC_CTL(base)));
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_Trng_MonSetApCC16
****************************************************************************//**
*
* Sets the Cutoff counter value of the adaptive proportion test monitor.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param ccCount
* The new Cutoff counter value.
*
*******************************************************************************/
__STATIC_INLINE void Cy_Cryptolite_Trng_MonSetApCC16(CRYPTOLITE_Type *base, uint16_t ccCount)
{
    CY_REG32_CLR_SET(REG_CRYPTOLITE_TRNG_MON_AP_CTL(base), CRYPTOLITE_TRNG_MON_AP_CTL_CUTOFF_COUNT16, ccCount);
}

